

interface StatData {
  世界: {
      日期: '2025-10-09';
      地点: '公寓中';
      时间: '21:00';
      当前人物: '{{user}},多多,何茉茉';
  },
  角色: {
    user: {
      特殊状态:{
        性压抑值: number;
        恶堕值: number;
        性压抑值变化原因?: string;
        恶堕值变化原因?: string;
      },
      服装: {
        上半身: "",
        下半身: "",
        内衣: "",
        袜子: "",
        鞋子: "",
        配饰: ""
      },
      身体状态:{
        阴茎:'正常下垂'
      },
      当前想法:'无'
    },
    多多:{
      特殊状态:{
        心情值: 60,
        心情值变化原因?: string;
        猫形态: true
      },
      服装: {
        上半身: "",
        下半身: "",
        内衣: "",
        袜子: "",
        鞋子: "",
        配饰: ""
      },
      身体状态:{
        小穴: '干燥紧闭',
        口穴: '未开发',
        菊穴: '未开发'
      },
      当前想法:'无'
    },
    何茉茉:{
      特殊状态:[],
      服装: {
        上半身: "",
        下半身: "",
        内衣: "",
        袜子: "",
        鞋子: "",
        配饰: ""
      },
      身体状态:{
        小穴: '干燥紧闭',
        口穴: '未开发',
        菊穴: '未开发'
      },
      当前想法:'无'
    },
  },
  version: '2.2.0',
  系统设置:{
    锁定多多形态:false
  },
}
