export interface StatData {
  世界: {
    日期: '';
    地点: '';
    时间: '';
    当前人物: '';
  };
  角色: {
    user: {
      特殊状态: {
        林安安: {
          亲密度: 0;
          亲密度变化原因: '无';
        };
        李沐: {
          亲密度: 0;
          亲密度变化原因: '无';
        };
        张小花: {
          亲密度: 0;
          亲密度变化原因: '无';
        };
        苏浅浅: {
          亲密度: 0;
          亲密度变化原因: '无';
        };
      };
      服装: {
        上半身: '';
        下半身: '';
        内衣: '';
        袜子: '';
        鞋子: '';
        配饰: '';
      };
      当前想法: '无';
    };
    林安安: {
      特殊状态: {
        好感度: 0;
        好感度变化原因: '无';
      };
      服装: {
        上半身: '';
        下半身: '';
        内衣: '';
        袜子: '';
        鞋子: '';
        配饰: '';
      };
      当前想法: '无';
    };
    李沐: {
      特殊状态: {
        好感度: 0;
        好感度变化原因: '无';
      };
      服装: {
        上半身: '';
        下半身: '';
        内衣: '';
        袜子: '';
        鞋子: '';
        配饰: '';
      };
      当前想法: '无';
    };
    张小花: {
      特殊状态: {
        好感度: 0;
        好感度变化原因: '无';
      };
      服装: {
        上半身: '';
        下半身: '';
        内衣: '';
        袜子: '';
        鞋子: '';
        配饰: '';
      };
      当前想法: '无';
    };
    苏浅浅: {
      特殊状态: {
        好感度: 0;
        好感度变化原因: '无';
      };
      服装: {
        上半身: '';
        下半身: '';
        内衣: '';
        袜子: '';
        鞋子: '';
        配饰: '';
      };
      当前想法: '无';
    };
  };
  任务: {
    $template?: {
      简介: '';
      目标: '';
      完成奖励: '';
      进度: 0;
      完成所需进度: 100;
      截止时间: '';
      已完成: false;
      已失效: false;
    };
  };
  version: '1.0.0';
  theme: 'autumn' | 'starry';
}
