export interface StatData {
  世界: {
    日期: string;
    地点: string;
    时间: string;
    当前人物: string;
  };
  角色: {
    user: {
      特殊状态: {
        好感度: number;
        好感度变化原因: string;
        暴露度: number;
        暴露度变化原因: string;
        调教经验值: number;
      };
      当前想法: string;
    };
    卡特琳娜: {
      特殊状态: {
        偏执度: number;
        偏执度变化原因: string;
        开发经验值: {
          胸部: number;
          左手: number;
          右手: number;
          左脚: number;
        };
      };
      服装: {
        外套: string;
        下身: string;
        内衣: string;
        内裤: string;
        袜子: string;
        配饰: string;
        玩具: string;
      };
      身体状态: {
        全身: string;
        胸部: string;
        左手: string;
        右手: string;
        左脚: string;
      };
      当前想法: string;
    };
    $meta: {
      necessary: 'all';
    };
  };
  身体开发等级: {
    卡特琳娜: {
      胸部: number;
      左手: number;
      右手: number;
      左脚: number;
    };
  };
  调教等级: number;
  任务: {
    $template: {
      目标: string;
      截止时间: '未知';
      已完成: false;
      已失败: false;
    };
  };
  好感度阶段: {
    user: {
      阶段一: 300;
      阶段二: 590;
      阶段三: 790;
      阶段四: 999;
      阶段五: 1000;
    };
  };
  偏执度阶段: {
    卡特琳娜: {
      阶段一: 160;
      阶段二: 290;
      阶段三: 400;
      阶段四: 680;
      阶段五: 800;
      阶段六: 999;
      阶段七: 1000;
    };
  };
  暴露度阶段: {
    user: {
      阶段一: 290;
      阶段二: 390;
      阶段三: 490;
      阶段四: 590;
      阶段五: 690;
      阶段六: 790;
      阶段七: 999;
      阶段八: 1000;
    };
  };
  调教等级阶段: {
    user: {
      阶段一: 5;
      阶段二: 10;
      阶段三: 15;
      阶段四: 25;
      阶段五: 35;
      阶段六: 45;
      阶段七: 55;
      阶段八: 65;
      阶段九: 75;
      阶段十: 85;
      阶段十一: 99;
      阶段十二: 100;
    };
  };
  开发度阶段: {
    小穴: {
      阶段一: 5;
      阶段二: 15;
      阶段三: 25;
      阶段四: 35;
      阶段五: 50;
      阶段六: 1000;
    };
    菊穴: {
      阶段一: 5;
      阶段二: 15;
      阶段三: 25;
      阶段四: 35;
      阶段五: 50;
      阶段六: 1000;
    };
    口穴: {
      阶段一: 5;
      阶段二: 15;
      阶段三: 25;
      阶段四: 35;
      阶段五: 50;
      阶段六: 1000;
    };
    胸部: {
      阶段一: 5;
      阶段二: 15;
      阶段三: 25;
      阶段四: 35;
      阶段五: 50;
      阶段六: 1000;
    };
  };
  数值变化限制: {
    好感度: {
      最大增值: 20;
      最大减值: 0;
    };
    暴露度: {
      最大增值: 10;
      最大减值: -5;
    };
    经验值: {
      最大增值: 30;
      最大减值: 0;
    };
  };
  theme: string;
  version: string;
}
